
#Область ПрограмныйИнтерфейс

Функция Настройки() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БИТС_Настройки.Наименование КАК Наименование,
		|	БИТС_Настройки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.БИТС_Настройки КАК БИТС_Настройки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат[Выборка.Наименование] = Выборка.Значение;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Спринты(URL, Группа, Обновить = Ложь) Экспорт
	
	Результат = Новый Соответствие;
	
	Фильтр = Новый Структура("GROUP_ID, STATUS", Группа, "active");
	
	Если Обновить Тогда
		
		Ответ = OPI_Bitrix24.ПолучитьСписокСпринтов(URL, Фильтр);
		Если Ответ["result"] = Неопределено Тогда 
			Возврат Результат;
		КонецЕсли;
		
		Спринты = Ответ["result"]; 
		
		РегистрыСведений.БИТС_Спринты.СоздатьНаборЗаписей().Обновить(Спринты);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	БИТС_Спринты.id КАК id,
			|	БИТС_Спринты.name КАК name,
			|	БИТС_Спринты.dateStart КАК dateStart,
			|	БИТС_Спринты.dateEnd КАК dateEnd
			|ИЗ
			|	РегистрСведений.БИТС_Спринты КАК БИТС_Спринты
			|ГДЕ
			|	БИТС_Спринты.groupId = &groupId
			|	И БИТС_Спринты.status = &status";
        Запрос.УстановитьПараметр("groupId", Фильтр["GROUP_ID"]);
		Запрос.УстановитьПараметр("status", Фильтр["STATUS"]);
		
		Спринты = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Для Каждого Спринт Из Спринты Цикл
		Результат["SPRINT_ID"] = Спринт["id"];
		Результат["SPRINT_NAME"] = Спринт["name"];
		Результат["SPRINT_START"] = Спринт["dateStart"];
		Результат["SPRINT_END"] = Спринт["dateEnd"];
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция Стадии(URL, Спринт, Обновить = Ложь) Экспорт
	
	Результат = Новый Соответствие;
	
	Если Обновить Тогда
		
		Ответ = OPI_Bitrix24.ПолучитьСтадииКанбанаСкрама(URL, Спринт);
		Если Ответ["result"] = Неопределено Тогда 
			Возврат Результат;
		КонецЕсли;
		
		Стадии = Ответ["result"];
		
		РегистрыСведений.БИТС_Стадии.СоздатьНаборЗаписей().Обновить(Стадии);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	БИТС_Стадии.id КАК id,
			|	БИТС_Стадии.name КАК name
			|ИЗ
			|	РегистрСведений.БИТС_Стадии КАК БИТС_Стадии";
		Стадии = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Для Каждого Стадия Из Стадии Цикл
		Результат[Стадия["id"]] = Новый Структура("Наименование, Заголовок");
		Результат[Стадия["id"]].Наименование = БИТС_СлужебныйСервер.CamelCase(Стадия["name"]);
		Результат[Стадия["id"]].Заголовок = СокрЛП(Стадия["name"]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти