
Функция ОсновныеЦвета() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Белый",				Новый Цвет(245, 247, 248));
	Результат.Вставить("Черный",			Новый Цвет(51, 51, 51));
	Результат.Вставить("Голубой",			Новый Цвет(91, 192, 222));
	Результат.Вставить("ГолубойТемный",		Новый Цвет(93, 181, 207));
	Результат.Вставить("Оранжевый",			Новый Цвет(240, 173, 78));
	Результат.Вставить("ОранжевыйТемный",	Новый Цвет(222, 165, 83));
	Результат.Вставить("Зеленый",			Новый Цвет(74, 172, 51));
	Результат.Вставить("ЗеленыйТемный",		Новый Цвет(67, 153, 45));
	
	Возврат Результат;
	
КонецФункции
Процедура НоваяКоманда(Форма, Имя, Действие, Заголовок) Экспорт
	
	НоваяКоманда = Форма.Команды.Добавить(Имя);
	НоваяКоманда.Действие = Действие;
	НоваяКоманда.Заголовок = Заголовок;
	
КонецПроцедуры

Процедура НоваяОбычнаяГруппа(Форма, Имя, Порядок) Экспорт
	
	НоваяГруппа = Форма.Элементы.Вставить(Имя, Тип("ГруппаФормы"), Форма, Форма.ПодчиненныеЭлементы[Порядок]);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	НоваяГруппа.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	НоваяГруппа.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры

Процедура НоваяКнопкаФормы(Форма, Имя, Владелец, Команда) Экспорт
	
	ОсновныеЦвета = ОсновныеЦвета();
	НоваяКнопка = Форма.Элементы.Добавить(Имя, Тип("КнопкаФормы"), Владелец);
	НоваяКнопка.ИмяКоманды = Команда;
	НоваяКнопка.Высота = 2;
	НоваяКнопка.ЦветФона = ОсновныеЦвета["Оранжевый"];
	НоваяКнопка.ЦветТекста = ОсновныеЦвета["Белый"];
	НоваяКнопка.ЦветРамки = ОсновныеЦвета["ОранжевыйТемный"];
	НоваяКнопка.Шрифт = Новый Шрифт("Arial", 10, Истина); 
	
КонецПроцедуры