
#Область ПрограммныйИнтерфейс

Функция ПолучитьДляЗадач(Знач URL, Знач ЗадачиСпринта, Знач Обновить = Ложь) Экспорт 
	
	Результат = Новый Соответствие;
	
	Если Обновить Тогда
		Результат = ЗапросБитрикс(URL, ЗадачиСпринта);
	Иначе
		Результат = ЗапросИБ();
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапросБитрикс(URL, ЗадачиСпринта)
	
	Результат = Новый Соответствие;
	
	Для Каждого Задача Из ЗадачиСпринта Цикл
		
		Результат[Задача] = Новый Массив;
		
		Ответ = OPI_Bitrix24.ПолучитьСписокРезультатов(URL, Задача);
		Если Ответ["result"] = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Для Каждого РезультатЗадачи Из Ответ["result"] Цикл
			СтруктураРезультата = Новый Структура("formattedText, files");
			СтруктураРезультата["formattedText"] = РезультатЗадачи["formattedText"];
			СтруктураРезультата["files"] = РезультатЗадачи["files"];
			Результат[Задача].Добавить(СтруктураРезультата);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросИБ()
	
	Результат = Новый Соответствие;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти