
Процедура Обновить(РезультатыЗадач) Экспорт
	
	ЭтотОбъект.Прочитать();
	
	Для Каждого РезультатЗадачи Из РезультатыЗадач Цикл
		НоваяЗапись = ЭтотОбъект.Добавить();
		НоваяЗапись["id"]				= РезультатЗадачи["id"];
		НоваяЗапись["taskId"]			= РезультатЗадачи["taskId"];
		НоваяЗапись["commentId"]		= РезультатЗадачи["commentId"];
		НоваяЗапись["formattedText"]	= РезультатЗадачи["formattedText"];
		НоваяЗапись["text"]				= РезультатЗадачи["text"];
	КонецЦикла;
	
	ЭтотОбъект.Записать(Истина);
	
КонецПроцедуры