
Процедура Обновить(Спринты) Экспорт
	
	ЭтотОбъект.Записать(Истина);
	ЭтотОбъект.Прочитать();
	
	Для Каждого Спринт Из Спринты Цикл
		НоваяЗапись = ЭтотОбъект.Добавить();
		НоваяЗапись["id"]			= Спринт["id"];
		НоваяЗапись["groupId"]		= Спринт["groupId"];
		НоваяЗапись["status"]		= Спринт["status"];
		НоваяЗапись["name"]			= Спринт["name"];
		НоваяЗапись["dateStart"]	= Спринт["dateStart"];
		НоваяЗапись["dateEnd"]		= Спринт["dateEnd"];
	КонецЦикла;
	
	ЭтотОбъект.Записать(Истина);
	
КонецПроцедуры