
#Область ПрограмныйИнтерфейс

Функция CamelCase(Знач Строка) Экспорт
	
	Результат = "";
	
	Строка = СтрЗаменить(Строка, ")", "");
	Строка = СтрЗаменить(Строка, "(", "");
	МассивСлов = СтрРазделить(Строка, " ");
	МассивСловСБольшойБуквы = Новый Массив;
	Для Каждого Слово Из МассивСлов Цикл
		МассивСловСБольшойБуквы.Добавить(ТРег(СокрЛП(Слово)));
	КонецЦикла;
	Результат = СтрСоединить(МассивСловСБольшойБуквы, "");
	
	Возврат Результат;
	
КонецФункции

Функция СекундыВЧасы(Знач Секунды) Экспорт
	Возврат Число(Секунды) / Число("3600");
КонецФункции

#КонецОбласти