
#Область ПрограммныйИнтерфейс

Функция СоответствияРезультатов(Знач РезультатыЗадач) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого РезультатЗадачи Из РезультатыЗадач Цикл
		Результат.Добавить(СоответствиеРезультата(РезультатЗадачи));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеРезультата(Знач РезультатЗадачи) Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Ссылка",		);
	Результат.Вставить("Номер",			);
	Результат.Вставить("Представление",	);
	Результат.Вставить("Результат",		);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьДокумент(Знач Дата, Знач СоответствияРезультатов) Экспорт
	
	Результат = Новый ТекстовыйДокумент;
	
	Макет = ПолучитьОбщийМакет("БИТС_Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата = Дата;
	Результат.Вывести(ОбластьШапка);
	
	Для Каждого СоответствиеРезультата Из СоответствияРезультатов Цикл
		ОбластьЗадача = Макет.ПолучитьОбласть("Результат");
		ОбластьЗадача.Параметры.Ссылка			= СоответствиеРезультата["Ссылка"];
		ОбластьЗадача.Параметры.Номер			= СоответствиеРезультата["Номер"];
		ОбластьЗадача.Параметры.Представление	= СоответствиеРезультата["Представление"];
		ОбластьЗадача.Параметры.Результат		= СоответствиеРезультата["Результат"];
		Результат.Вывести(ОбластьЗадача);
	КонецЦикла;    
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти
